danielbalster/a500kbd-usbhid-stm32/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */

#include <stdarg.h>
#include <stdint.h>
#include <limits.h>
#include "usbd_hid.h"
#include "usbhid.h"
#include "dwt_stm32_delay.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef htim1;
UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

#define SYSTEM_US_TICKS (SystemCoreClock / 1000000) // cycles per microsecond


// http://www.keyboard-layout-editor.com/##@_name=Amiga%20500%20Keyboard%20w%2F%2F%20Custom%20Mapping&author=Daniel%20Balster&radii=10&css=.db%20%7B%7D%0D%0A.lmb%2F:after%20%7B%20%0D%0A%20%20%2F%2F*%20Set%20the%20background%20for%20this%20glyph%20to%20your%20image%20*%2F%2F%0D%0A%20%20background-image%2F:%20url('https%2F:%2F%2F%2F%2Fimage.flaticon.com%2F%2Ficons%2F%2Fsvg%2F%2F32%2F%2F32041.svg')%2F%3B%20%0D%0A%20%20background-repeat%2F:%20no-repeat%2F%3B%0D%0A%20%20background-position%2F:%20center%2F%3B%0D%0A%0D%0A%20%20%2F%2F*%20Content%20is%20required%20for%20it%20to%20appear%2F%3B%20this%20is%20a%20non-breaking-space%20*%2F%2F%0D%0A%20%20content%2F:'%5C00a0'%2F%3B%20%0D%0A%20%20display%2F:inline-block%2F%3B%20%0D%0A%0D%0A%20%20%2F%2F*%20Sizing%20in%20EMs%20allows%20the%20glyph%20to%20scale%20with%20the%20font-size%20*%2F%2F%0D%0A%20%20width%2F:%201em%2F%3B%20%0D%0A%20%20height%2F:%201em%2F%3B%20%0D%0A%20%20background-size%2F:%201em%2F%3B%20%0D%0A%7D%0D%0A%0D%0A.rmb%2F:after%20%7B%20%0D%0A%20%20%2F%2F*%20Set%20the%20background%20for%20this%20glyph%20to%20your%20image%20*%2F%2F%0D%0A%20%20background-image%2F:%20url('https%2F:%2F%2F%2F%2Fimage.flaticon.com%2F%2Ficons%2F%2Fsvg%2F%2F31%2F%2F31532.svg')%2F%3B%20%0D%0A%20%20background-repeat%2F:%20no-repeat%2F%3B%0D%0A%20%20background-position%2F:%20center%2F%3B%0D%0A%0D%0A%20%20%2F%2F*%20Content%20is%20required%20for%20it%20to%20appear%2F%3B%20this%20is%20a%20non-breaking-space%20*%2F%2F%0D%0A%20%20content%2F:'%5C00a0'%2F%3B%20%0D%0A%20%20display%2F:inline-block%2F%3B%20%0D%0A%0D%0A%20%20%2F%2F*%20Sizing%20in%20EMs%20allows%20the%20glyph%20to%20scale%20with%20the%20font-size%20*%2F%2F%0D%0A%20%20width%2F:%201em%2F%3B%20%0D%0A%20%20height%2F:%201em%2F%3B%20%0D%0A%20%20background-size%2F:%201em%2F%3B%20%0D%0A%7D%0D%0A.pointer%2F:after%20%7B%20%0D%0A%20%20%2F%2F*%20Set%20the%20background%20for%20this%20glyph%20to%20your%20image%20*%2F%2F%0D%0A%20%20background-image%2F:%20url('https%2F:%2F%2F%2F%2Fwww.shareicon.net%2F%2Fdownload%2F%2F2016%2F%2F11%2F%2F03%2F%2F850264%2F_arrow.svg')%2F%3B%20%0D%0A%20%20background-repeat%2F:%20no-repeat%2F%3B%0D%0A%20%20background-position%2F:%20center%2F%3B%0D%0A%0D%0A%20%20%2F%2F*%20Content%20is%20required%20for%20it%20to%20appear%2F%3B%20this%20is%20a%20non-breaking-space%20*%2F%2F%0D%0A%20%20content%2F:'%5C00a0'%2F%3B%20%0D%0A%20%20display%2F:inline-block%2F%3B%20%0D%0A%0D%0A%20%20%2F%2F*%20Sizing%20in%20EMs%20allows%20the%20glyph%20to%20scale%20with%20the%20font-size%20*%2F%2F%0D%0A%20%20width%2F:%201em%2F%3B%20%0D%0A%20%20height%2F:%201em%2F%3B%20%0D%0A%20%20background-size%2F:%201em%2F%3B%20%0D%0A%7D%0D%0A&plate:true&pcb:false%3B&@_c=%23aca693&p=SA%20R1%3B&=Esc%0A%0A%0A%0A%0A%0A%0A%0A%0A%0APause&_x:0.5&w:1.25%3B&=F1%0AF11%0A%0A%3Ci%20class%2F='kb%20kb-Multimedia-Rewind-Start'%3E%3C%2F%2Fi%3E&_w:1.25%3B&=F2%0AF12%0A%0A%3Ci%20class%2F='kb%20kb-Multimedia-Stop'%3E%3C%2F%2Fi%3E&_w:1.25%3B&=F3%0AF13%0A%0A%3Ci%20class%2F='kb%20kb-Multimedia-Play-Pause'%3E%3C%2F%2Fi%3E&_w:1.25%3B&=F4%0AF14%0A%0A%3Ci%20class%2F='kb%20kb-Multimedia-FastForward-End'%3E%3C%2F%2Fi%3E&_w:1.25%3B&=F5%0AF15%0A%0A%3Ci%20class%2F='kb%20kb-Multimedia-Eject'%3E%3C%2F%2Fi%3E&_x:0.5&w:1.25%3B&=F6%0AF16&_w:1.25%3B&=F7%0AF17&_w:1.25%3B&=F8%0AF18%0A%0A%3Ci%20class%2F='kb%20kb-Multimedia-Mute-3'%3E%3C%2F%2Fi%3E&_w:1.25%3B&=F9%0AF19%0A%0A%3Ci%20class%2F='kb%20kb-Multimedia-Volume-Down-2'%3E%3C%2F%2Fi%3E&_w:1.25%3B&=F10%0AF20%0A%0A%3Ci%20class%2F='kb%20kb-Multimedia-Volume-Up-1'%3E%3C%2F%2Fi%3E%3B&@_y:0.25&c=%23c87e74&w:1.5%3B&=~%0A'%0A%C2%B0%0A%5E&_c=%23d8d2c3&fa@:5&:5%3B%3B&=!%0A1&=%22%0A2%0A%0A%0A%2F@&=%C2%A7%0A3&=$%0A4%0A%0A%0A%C2%B0&=%25%0A5&=%2F&%0A6&=%2F%2F%0A7%0A%0A%7B&=(%0A8%0A%0A%5B&=)%0A9%0A%0A%5D&=%2F=%0A0%0A%0A%7D&=%3F%0A%C3%9F%0A%0A%5C&=%60%0A%C2%B4&_c=%23c87e74%3B&=%7C%0A%5C%0A'%0A%23&_c=%23aca693&fa@:9%3B%3B&=%3Ci%20class%2F='kb%20kb-Arrows-Left'%3E%3C%2F%2Fi%3E&_x:0.75&c=%237fa580&f:3&w:1.5%3B&=Del%0A%0A%3Ci%20class%2F='db%20lmb'%3E%3C%2F%2Fi%3E%0A%0A%0A%0A%0A%0A%0A%0Aswitch%20fn%3B&@_c=%23aca693&f:3&w:2%3B&=%3Ci%20class%2F='kb%20kb-Line-Start'%3E%3C%2F%2Fi%3E%0A%3Ci%20class%2F='kb%20kb-Line-End'%3E%3C%2F%2Fi%3E&_c=%23d8d2c3&fa@:7%3B%3B&=Q&=W&=E&=R&=T&=Z&=U&=I&=O&=P&=%C3%9C&_fa@:5&:5%3B%3B&=*%0A+%0A%0A~&_x:0.25&c=%23aca693&a:7&fa@:9%3B&w:1.25&h:2&w2:1.5&h2:1&x2:-0.25%3B&=%3Ci%20class%2F='kb%20kb-Return-2'%3E%3C%2F%2Fi%3E%3B&@_a:4&f:3&w:1.25%3B&=Ctrl%0A%0A%0AL%20Alt&_c=%23e5a100%3B&=%0ALock%0A%3Ci%20class%2F='fa%20fa-random'%3E%3C%2F%2Fi%3E%0A%0A%0A%0ACaps&_c=%23d8d2c3&fa@:7%3B%3B&=A&=S&=D&_n:true%3B&=F&_c=%237fa580%3B&=G%0A%0A%0A%3Ci%20class%2F='fa%20fa-gamepad'%3E%3C%2F%2Fi%3E&_c=%23d8d2c3%3B&=H&_n:true%3B&=J&=K&=L&=%C3%96&=%C3%84&_c=%23c87e74&f:3%3B&=%5E%0A%23%0A'%3B&@_c=%23aca693&fa@:9%3B&w:1.75%3B&=%3Ci%20class%2F='kb%20kb-Arrows-Top-4'%3E%3C%2F%2Fi%3E&_c=%23d8d2c3&f:3%3B&=%3E%0A%3C%0A%0A%7C&_fa@:7%3B%3B&=Y&=X&=C&=V&=B&=N&_c=%237fa580%3B&=M%0A%0A%0A%3Ci%20class%2F='fa%20fa-mouse-pointer'%3E%3C%2F%2Fi%3E&_c=%23d8d2c3&fa@:5&:5%3B%3B&=%2F%3B%0A,&=%2F:%0A.&=%2F_%0A-&_c=%23aca693&fa@:9%3B&w:2.75%3B&=%3Ci%20class%2F='kb%20kb-Arrows-Top-4'%3E%3C%2F%2Fi%3E%3B&@_x:0.75&t=%23171718&f:3&w:1.25%3B&=Alt%0A%0A%0AL%20Ctrl&_t=%23000000&f:3&w:1.25%3B&=%3Ci%20class%2F='kb%20kb-logo-commodore'%3E%3C%2F%2Fi%3E%0A%0A%0A%3Ci%20class%2F='kb%20kb-logo-windows-8'%3E%3C%2F%2Fi%3E&_c=%23d8d2c3&a:7&w:9%3B&=&_c=%23aca693&a:4&f:3&w:1.25%3B&=%3Ci%20class%2F='kb%20kb-logo-amiga'%3E%3C%2F%2Fi%3E%0A%0A%0AAlt%20Gr&_f:3&w:1.25%3B&=Alt%0A%0A%0AR%20Ctrl%3B&@_rx:0.25&y:1.25&x:17.5&c=%237fa580&f:3&w:1.5%3B&=Help%0A%0A%3Ci%20class%2F='db%20rmb'%3E%3C%2F%2Fi%3E&_x:0.75&c=%23aca693&a:0&f:3%3B&=%7B%0A%5B%0A%0A%0ANum%20L&_f:3%3B&=%7D%0A%5D%0A%0A%0AScr%20L&_a:4&f:3%3B&=%2F%2F&_c=%237fa580&a:0&f:3%3B&=*%0A%0A%0AExit%20Mode%0APrt%20Sc%3B&@_x:19.75&c=%23d8d2c3&f:3%3B&=7%0A%0A%0A%0AHome&_a:4&f:3%3B&=8%0A%0A%0A%0A%3Ci%20class%2F='kb%20kb-Arrows-Up'%3E%3C%2F%2Fi%3E&_a:0&f:3%3B&=9%0A%0A%0A%0A%0APg%20Up&_c=%237fa580&a:4&f:3%3B&=-%0A%0A%0ASpd-%3B&@_x:17&f:3%3B&=%3Ci%20class%2F='kb%20kb-Arrows-Up'%3E%3C%2F%2Fi%3E%0A%0A%0A%3Ci%20class%2F='fa%20fa-arrow-up'%3E%3C%2F%2Fi%3E&_x:1.75&c=%23d8d2c3&f:3%3B&=4%0A%0A%0A%0A%3Ci%20class%2F='kb%20kb-Arrows-Left'%3E%3C%2F%2Fi%3E&_f:3%3B&=5&_f:3%3B&=6%0A%0A%0A%0A%3Ci%20class%2F='kb%20kb-Arrows-Right'%3E%3C%2F%2Fi%3E&_c=%237fa580&f:3%3B&=+%0A%0A%0ASpd+%3B&@_x:16&f:3%3B&=%3Ci%20class%2F='kb%20kb-Arrows-Left'%3E%3C%2F%2Fi%3E%0A%0A%0A%3Ci%20class%2F='fa%20fa-arrow-left'%3E%3C%2F%2Fi%3E&_f:3%3B&=%3Ci%20class%2F='kb%20kb-Arrows-Down'%3E%3C%2F%2Fi%3E%0A%0A%0A%3Ci%20class%2F='fa%20fa-arrow-down'%3E%3C%2F%2Fi%3E&_f:3%3B&=%3Ci%20class%2F='kb%20kb-Arrows-Right'%3E%3C%2F%2Fi%3E%0A%0A%0A%3Ci%20class%2F='fa%20fa-arrow-right'%3E%3C%2F%2Fi%3E&_x:0.75&c=%23d8d2c3&a:0&f:3%3B&=1%0A%0A%0A%0AEnd&_a:4&f:3%3B&=2%0A%0A%0A%0A%3Ci%20class%2F='kb%20kb-Arrows-Down'%3E%3C%2F%2Fi%3E&_a:0&f:3%3B&=3%0A%0A%0A%0A%0APg%20Dn&_c=%23aca693&a:4&f:3&h:2%3B&=Enter%3B&@_x:19.75&c=%23d8d2c3&f:3&w:2%3B&=0%0A%0A%0A%0AIns&_f:3%3B&=1%0A%0A%0A%0ADel

