danielbalster/a500kbd-usbhid-stm32/Src/main.c
// page 362 of Amiga Hardware Reference Manual

enum {
  AMIGA_KEY_TILDE,
  AMIGA_KEY_1,
  AMIGA_KEY_2,
  AMIGA_KEY_3,
  AMIGA_KEY_4,
  AMIGA_KEY_5,
  AMIGA_KEY_6,
  AMIGA_KEY_7,
  AMIGA_KEY_8,
  AMIGA_KEY_9,
  AMIGA_KEY_0,
  AMIGA_KEY_UNDERSCORE,
  AMIGA_KEY_PLUS,
  AMIGA_KEY_BACKSLASH,
  AMIGA_KEY_NOT_CONNECTED_0E,
  AMIGA_KEY_KP_0,

  AMIGA_KEY_Q,
  AMIGA_KEY_W,
  AMIGA_KEY_E,
  AMIGA_KEY_R,
  AMIGA_KEY_T,
  AMIGA_KEY_Y,
  AMIGA_KEY_U,
  AMIGA_KEY_I,
  AMIGA_KEY_O,
  AMIGA_KEY_P,
  AMIGA_KEY_OPEN_BRACKET,
  AMIGA_KEY_CLOSE_BRACKET,
  AMIGA_KEY_NOT_CONNECTED_1C,
  AMIGA_KEY_KP_1,
  AMIGA_KEY_KP_2,
  AMIGA_KEY_KP_3,
                                                  
  AMIGA_KEY_A,
  AMIGA_KEY_S,
  AMIGA_KEY_D,
  AMIGA_KEY_F,
  AMIGA_KEY_G,
  AMIGA_KEY_H,
  AMIGA_KEY_J,
  AMIGA_KEY_K,
  AMIGA_KEY_L,
  AMIGA_KEY_COLON,
  AMIGA_KEY_QUOTE,
  AMIGA_KEY_HASH,
  AMIGA_KEY_NOT_CONNECTED_2C,
  AMIGA_KEY_KP_4,
  AMIGA_KEY_KP_5,
  AMIGA_KEY_KP_6,

  AMIGA_KEY_NON_US_BACKSLASH_AND_SLASH,
  AMIGA_KEY_Z,
  AMIGA_KEY_X,
  AMIGA_KEY_C,
  AMIGA_KEY_V,
  AMIGA_KEY_B,
  AMIGA_KEY_N,
  AMIGA_KEY_M,
  AMIGA_KEY_COMMA,
  AMIGA_KEY_DOT,
  AMIGA_KEY_SLASH,
  AMIGA_KEY_NOT_CONNECTED_3B,
  AMIGA_KEY_KP_DOT_AND_DELETE,
  AMIGA_KEY_KP_7,
  AMIGA_KEY_KP_8,
  AMIGA_KEY_KP_9,
                                                  
  AMIGA_KEY_SPACEBAR,
  AMIGA_KEY_BACKSPACE,
  AMIGA_KEY_TAB,
  AMIGA_KEY_KP_ENTER,
  AMIGA_KEY_ENTER,
  AMIGA_KEY_ESCAPE,
  AMIGA_KEY_DELETE,
  AMIGA_KEY_NOT_CONNECTED_47,
  AMIGA_KEY_NOT_CONNECTED_48,
  AMIGA_KEY_NOT_CONNECTED_49,
  AMIGA_KEY_KP_MINUS,
  AMIGA_KEY_NOT_CONNECTED_4B,
  AMIGA_KEY_UP,
  AMIGA_KEY_DOWN,
  AMIGA_KEY_RIGHT,
  AMIGA_KEY_LEFT,
                                                  
  AMIGA_KEY_F1,
  AMIGA_KEY_F2,
  AMIGA_KEY_F3,
  AMIGA_KEY_F4,
  AMIGA_KEY_F5,
  AMIGA_KEY_F6,
  AMIGA_KEY_F7,
  AMIGA_KEY_F8,
  AMIGA_KEY_F9,
  AMIGA_KEY_F10,
  AMIGA_KEY_KP_NUM_LOCK,
  AMIGA_KEY_SCROLL_LOCK,
  AMIGA_KEY_KP_DIVIDE,
  AMIGA_KEY_KP_MULTIPLY,
  AMIGA_KEY_KP_PLUS,
  AMIGA_KEY_HELP,

  AMIGA_KEY_MODIFIER_LEFT_SHIFT,
  AMIGA_KEY_MODIFIER_RIGHT_SHIFT,
  AMIGA_KEY_CAPS_LOCK,
  AMIGA_KEY_MODIFIER_LEFT_CTRL,
  AMIGA_KEY_MODIFIER_LEFT_ALT,
  AMIGA_KEY_MODIFIER_RIGHT_ALT,
  AMIGA_KEY_MODIFIER_LEFT_UI,
  AMIGA_KEY_MODIFIER_RIGHT_UI,
};

const uint8_t amiga_to_hid[128] = {
  HIDKEY_TILDE,                                  // 00
  HIDKEY_1,                                      // 01
  HIDKEY_2,                                      // 02
  HIDKEY_3,                                      // 03
  HIDKEY_4,                                      // 04
  HIDKEY_5,                                      // 05
  HIDKEY_6,                                      // 06
  HIDKEY_7,                                      // 07
  HIDKEY_8,                                      // 08
  HIDKEY_9,                                      // 09
  HIDKEY_0,                                      // 0A
  HIDKEY_UNDERSCORE,                             // 0B
  HIDKEY_PLUS,                                   // 0C
  HIDKEY_BACKSLASH,                              // 0D
  0,                                             // 0E not connected
  HIDKEY_KP_0,                                   // 0F

  HIDKEY_Q,                                      // 10
  HIDKEY_W,                                      // 11
  HIDKEY_E,                                      // 12
  HIDKEY_R,                                      // 13
  HIDKEY_T,                                      // 14
  HIDKEY_Y,                                      // 15
  HIDKEY_U,                                      // 16
  HIDKEY_I,                                      // 17
  HIDKEY_O,                                      // 18
  HIDKEY_P,                                      // 19
  HIDKEY_OPEN_BRACKET,                           // 1A
  HIDKEY_CLOSE_BRACKET,                          // 1B
  0,                                             // 1C not connected
  HIDKEY_KP_1,                                   // 1D
  HIDKEY_KP_2,                                   // 1E
  HIDKEY_KP_3,                                   // 1F
                                                  
  HIDKEY_A,                                      // 20
  HIDKEY_S,                                      // 21
  HIDKEY_D,                                      // 22
  HIDKEY_F,                                      // 23
  HIDKEY_G,                                      // 24
  HIDKEY_H,                                      // 25
  HIDKEY_J,                                      // 26
  HIDKEY_K,                                      // 27
  HIDKEY_L,                                      // 28
  HIDKEY_COLON,                                  // 29
  HIDKEY_QUOTE,                                  // 2A
  HIDKEY_HASH,                                   // 2B
  0,                                             // 2C not connected
  HIDKEY_KP_4,                                   // 2D
  HIDKEY_KP_5,                                   // 2E
  HIDKEY_KP_6,                                   // 2F

  HIDKEY_NON_US_BACKSLASH_AND_SLASH,             // 30
  HIDKEY_Z,                                      // 31
  HIDKEY_X,                                      // 32
  HIDKEY_C,                                      // 33
  HIDKEY_V,                                      // 34
  HIDKEY_B,                                      // 35
  HIDKEY_N,                                      // 36
  HIDKEY_M,                                      // 37
  HIDKEY_COMMA,                                  // 38
  HIDKEY_DOT,                                    // 39
  HIDKEY_SLASH,                                  // 3A
  0,                                             // 3B // not connected
  HIDKEY_KP_DOT_AND_DELETE,                      // 3C
  HIDKEY_KP_7,                                   // 3D
  HIDKEY_KP_8,                                   // 3E
  HIDKEY_KP_9,                                   // 3F
                                                  
  HIDKEY_SPACEBAR,                               // 40
  HIDKEY_BACKSPACE,                              // 41
  HIDKEY_TAB,                                    // 42
  HIDKEY_KP_ENTER,                               // 43
  HIDKEY_ENTER,                                  // 44
  HIDKEY_ESCAPE,                                 // 45
  HIDKEY_DELETE,                                 // 46
  0,                                             // 47
  0,                                             // 48
  0,                                             // 49
  HIDKEY_KP_MINUS,                               // 4A
  0,                                             // 4B
  HIDKEY_UP,                                     // 4C
  HIDKEY_DOWN,                                   // 4D
  HIDKEY_RIGHT,                                  // 4E
  HIDKEY_LEFT,                                   // 4F
                                                  
  HIDKEY_F1,                                     // 50
  HIDKEY_F2,                                     // 51
  HIDKEY_F3,                                     // 52
  HIDKEY_F4,                                     // 53
  HIDKEY_F5,                                     // 54
  HIDKEY_F6,                                     // 55
  HIDKEY_F7,                                     // 56
  HIDKEY_F8,                                     // 57
  HIDKEY_F9,                                     // 58
  HIDKEY_F10,                                    // 59
  HIDKEY_KP_NUM_LOCK,                            // 5A Numeric pad left (
  HIDKEY_SCROLL_LOCK,                            // 5B Numeric pad right )
  HIDKEY_KP_DIVIDE,                              // 5C
  HIDKEY_KP_MULTIPLY,                            // 5D
  HIDKEY_KP_PLUS,                                // 5E
  HIDKEY_HELP,                                   // 5F help

  HIDKEY_MODIFIER_LEFT_SHIFT,                    // 60 Left Shift
  HIDKEY_MODIFIER_RIGHT_SHIFT,                   // 61 Right Shift
  HIDKEY_CAPS_LOCK,                              // 62 Caps Lock
  HIDKEY_MODIFIER_LEFT_CTRL,                     // 63 Control
  HIDKEY_MODIFIER_LEFT_ALT,                      // 64 Left Alt
  HIDKEY_MODIFIER_RIGHT_ALT,                     // 65 Right Alt
  HIDKEY_MODIFIER_LEFT_UI,                       // 66 Left Amiga
  HIDKEY_MODIFIER_RIGHT_UI,                      // 67 Right Amiga
  0,                                             // 68
  0,                                             // 69
  0,                                             // 6A
  0,                                             // 6B
  0,                                             // 6C
  0,                                             // 6D
  0,                                             // 6E
  0,                                             // 6F
                                                  
  0,                                             // 70
  0,                                             // 71
  0,                                             // 72
  0,                                             // 73
  0,                                             // 74
  0,                                             // 75
  0,                                             // 76
  0,                                             // 77
  0,                                             // 78
  0,                                             // 79
  0,                                             // 7A
  0,                                             // 7B
  0,                                             // 7C
  0,                                             // 7D
  0,                                             // 7E
  0,                                             // 7F
};

uint8_t media_table[10] = {
  HIDKEY_MEDIA_SCAN_PREV,
  HIDKEY_MEDIA_STOP,
  HIDKEY_MEDIA_PAUSE,
  HIDKEY_MEDIA_SCAN_NEXT,
  HIDKEY_MEDIA_EJECT,
  0,
  0,
  HIDKEY_MEDIA_MUTE,
  HIDKEY_MEDIA_VOLUME_DOWN,
  HIDKEY_MEDIA_VOLUME_UP,
};

uint8_t fn_table[10] = {
  HIDKEY_F11,
  HIDKEY_F12,
  HIDKEY_F13,
  HIDKEY_F14,
  HIDKEY_F15,
  HIDKEY_F16,
  HIDKEY_F17,
  HIDKEY_F18,
  HIDKEY_F19,
  HIDKEY_F20,
};

