danielbalster/a500kbd-usbhid-stm32/Src/main.c
uint8_t gamepad_button_table[16] = {
  AMIGA_KEY_A,
  AMIGA_KEY_B,
  AMIGA_KEY_X,
  AMIGA_KEY_Z,
  AMIGA_KEY_MODIFIER_LEFT_ALT,
  AMIGA_KEY_MODIFIER_RIGHT_ALT,
  AMIGA_KEY_MODIFIER_LEFT_SHIFT,
  AMIGA_KEY_MODIFIER_RIGHT_SHIFT,
  AMIGA_KEY_MODIFIER_LEFT_UI,
  AMIGA_KEY_MODIFIER_RIGHT_UI,
  AMIGA_KEY_HELP,
  AMIGA_KEY_DELETE,
  AMIGA_KEY_SPACEBAR,
  AMIGA_KEY_ENTER,
  AMIGA_KEY_ESCAPE,
  AMIGA_KEY_TAB,
  
};

struct mouseHID_t {
  uint8_t id;
  uint8_t buttons;
  int8_t x;
  int8_t y;
};
struct keyboardHID_t {
    uint8_t id;
    uint8_t modifiers;
    uint8_t key[6];
};

struct mediaHID_t {
  uint8_t id;
  uint8_t keys;
};

struct gamepadHID_t {
  uint8_t id;
  uint8_t pad;
  uint16_t buttons;
  int16_t x;
  int16_t y;
  int16_t x2;
  int16_t y2;
};

struct eeprom_config {
  char swap_ctrl_and_alt;
  char mouse_speed;
  char gamepad_sensitivity;
  char media_keys;
};
    
struct eeprom_config settings = {
  .swap_ctrl_and_alt = 0,
  .mouse_speed = 3,
  .gamepad_sensitivity = 128,
  .media_keys = 1,
};

struct keyboardHID_t keyboardHID;
struct mediaHID_t mediaHID, lastMediaHID;
struct mouseHID_t mouseHID, lastMouseHID;
struct gamepadHID_t gamepadHID, lastGamepadHID;

uint8_t buffer_data[8];
char help_mode = 0;
char extended_mode = 0;
char powerup_mode = 0;
char thrust_x = 0;
char thrust_y = 0;
int elapsed_ms_counter = 0;
int n_pressed_keys = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_NVIC_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

void Printf(const char *_fmt, ... );

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

static inline void HID_Send(const void *data,const size_t size)
{
  //Printf("Sending: ");
  //for (int i=0; i<size; ++i)
  //{
  //  Printf("%02x ",((uint8_t*)data)[i]);
  //}
  //Printf("\n\r");
  uint8_t status;
  do
  {
    status = USBD_HID_SendReport(&hUsbDeviceFS, (uint8_t *)data, size);
    if (status==USBD_FAIL)
    {
      Printf("USB: fail\n\r");
    }
  }
  while (status == USBD_BUSY);
}

void ApplyThrust()
{
  int x = gamepadHID.x;
  int y = gamepadHID.y;
  x += ((int)thrust_x) * ((int)settings.gamepad_sensitivity);
  y += ((int)thrust_y) * ((int)settings.gamepad_sensitivity);
  if (x<-32768) x=-32768;
  if (x>32767) x=32767;
  if (y<-32768) y=-32768;
  if (y>32767) y=32767;
  if (x<0) x += 64;
  if (x>0) x -= 64;
  if (y<0) y += 64;
  if (y>0) y -= 64;
  gamepadHID.x = x;
  gamepadHID.y = y;
}

// activate DWT timer
void EnableTiming(void)
{
  CoreDebug->DEMCR &= ~CoreDebug_DEMCR_TRCENA_Msk;
  CoreDebug->DEMCR |=  CoreDebug_DEMCR_TRCENA_Msk;
  DWT->CTRL &= ~DWT_CTRL_CYCCNTENA_Msk;
  DWT->CTRL |=  DWT_CTRL_CYCCNTENA_Msk;
  DWT->CYCCNT = 0;
}

// microsecond version
uint32_t HAL_GetTicks_us()
{
  return DWT->CYCCNT / SYSTEM_US_TICKS;
}

// microsecond version
void HAL_Delay_us(uint32_t uSec)
{
  volatile uint32_t DWT_START = DWT->CYCCNT;
  if (uSec > (UINT_MAX / SYSTEM_US_TICKS))
  {
    uSec = (UINT_MAX / SYSTEM_US_TICKS);
  }

  volatile uint32_t DWT_TOTAL = (SYSTEM_US_TICKS * uSec);

  while((DWT->CYCCNT - DWT_START) < DWT_TOTAL);
}

void Print(const char *_buf )
{
  HAL_UART_Transmit(&huart1, (uint8_t *)_buf, strlen(_buf), 1000);
}

void Printf(const char *_fmt, ... )
{
  char buf[512];
  va_list ap;
  va_start(ap, _fmt);
  int len = vsprintf(buf, _fmt,ap);
  va_end(ap);
  HAL_UART_Transmit(&huart1, (uint8_t *)buf, len, 1000);
}

void SetExtendedMode(char on)
{
  extended_mode = on;
  
  switch (extended_mode)
  {
  case 0:
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14|GPIO_PIN_15, GPIO_PIN_RESET);
    Printf("default mode\n\r");
    break;
  case 1:
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_15, GPIO_PIN_RESET);
    Printf("mouse mode\n\r");
    break;
  case 2:
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_15, GPIO_PIN_SET);
    Printf("gamepad mode\n\r");
    break;
  }
  
}

void SetMediaKeysMode()
{
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, settings.media_keys ? GPIO_PIN_SET : GPIO_PIN_RESET);
  if (settings.media_keys)
  {
    Printf("function keys are media keys\n\r");
  }
  else
  {
    Printf("extended function keys (F11-F20)\n\r");
  }
}


void HardReset()
{
  GPIO_InitTypeDef GPIO_InitStruct;

  GPIO_InitStruct.Pin = RESET_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  HAL_GPIO_WritePin(GPIOA,RESET_Pin,GPIO_PIN_SET);
  HAL_Delay(200);
  HAL_GPIO_WritePin(GPIOA,RESET_Pin,GPIO_PIN_RESET);
  HAL_Delay(200);
  HAL_GPIO_WritePin(GPIOA,RESET_Pin,GPIO_PIN_SET);
  HAL_Delay(200);

  GPIO_InitStruct.Pin = RESET_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

void SoftReset()
{
  Printf("*** A500 USB HID Keyboard Firmware ***\n\r");

  uint32_t revid = HAL_GetREVID();
  uint32_t devid = HAL_GetDEVID();
  uint32_t uid[3];
  HAL_GetUID(uid);
  Printf("rev=%08lx dev=%08lx\n\r",revid,devid);
  Printf("uid=%08lx%08lx%08lx\n\r",uid[0],uid[1],uid[2]);
  
  keyboardHID.id = 1;
  keyboardHID.modifiers = 0;
  keyboardHID.key[0] = 0;
  keyboardHID.key[1] = 0;
  keyboardHID.key[2] = 0;
  keyboardHID.key[3] = 0;
  keyboardHID.key[4] = 0;
  keyboardHID.key[5] = 0;
  
  mediaHID.id = 2;
  mediaHID.keys = 0;

  mouseHID.buttons = 0;
  mouseHID.id = 3;
  mouseHID.x = 0;
  mouseHID.y = 0;
  
  gamepadHID.id = 4;
  gamepadHID.pad = 0;
  gamepadHID.buttons = 0;
  gamepadHID.x = 0;
  gamepadHID.y = 0;
  
  lastMediaHID = mediaHID;
  lastMouseHID = mouseHID;
  lastGamepadHID = gamepadHID;
  
  n_pressed_keys=0;
  
  thrust_x = 0;
  thrust_y = 0;
  
  SetExtendedMode(0);
  SetMediaKeysMode();
  help_mode = 0;
  elapsed_ms_counter = 0;

  buffer_data[0] = 0;
  buffer_data[1] = 0;
  buffer_data[2] = 0;
  buffer_data[3] = 0;
  buffer_data[4] = 0;
  buffer_data[5] = 0;
  buffer_data[6] = 0;
  buffer_data[7] = 0;
}

