danielbalster/a500kbd-usbhid-stm32/Src/main.c
int HandleKey(uint8_t key)
{
  switch(key)
  {
  case 0x78:
    Printf("reset warning\n\r");
    return 0;
  case 0xF9:
    Printf("last key code bad\n\r");
    return 0;
  case 0xFA:
    Printf("keyboard key buffer overflow\n\r");
    return 0;
  case 0xFC:
    Printf("keyboard self test fail\n\r");
    return 0;
  case 0xFD:
    Printf("initiate power-up key stream\n\r");
    powerup_mode = 1;
    return 0;
  case 0xFE:
    Printf("terminate power-up key stream\n\r");
    powerup_mode = 0;
    SoftReset();
    return 0;
  default:
    break;
  }
  uint8_t raw = key & 0x7f;
  int pressed = ((key & 0x80) >> 7) ^ 1;
  char touched=0;
  uint8_t code;

  if (powerup_mode)
  {
    Printf("%02x\n\r",raw);
    return 0;
  }
 
  code = amiga_to_hid[raw];
 
  if (raw == AMIGA_KEY_CAPS_LOCK)
  {
     settings.swap_ctrl_and_alt = pressed;
     Printf("swap_ctrl_and_alt = %d\n\r",settings.swap_ctrl_and_alt);
     return 0;
  }

  if (extended_mode==1)
  {
    if (code==HIDKEY_KP_MULTIPLY)
    {
      SetExtendedMode(0);
      mouseHID.buttons = 0;
      mouseHID.x = 0;
      mouseHID.y = 0;
    }

    if (code==HIDKEY_KP_PLUS)
    {
      if (pressed)
      {
        if (settings.mouse_speed<20) settings.mouse_speed++;
        Printf("mouse speed: %d\n\r",settings.mouse_speed);
      }
      return 0;
    }

    if (code==HIDKEY_KP_MINUS)
    {
      if (pressed)
      {
        if (settings.mouse_speed>1) settings.mouse_speed--;
        Printf("mouse speed: %d\n\r",settings.mouse_speed);
      }
      return 0;
    }

    if (code==HIDKEY_DELETE)
    {
      if (pressed)
        mouseHID.buttons |= 1;
      else
        mouseHID.buttons &=~ 1;
    }
    if (code==HIDKEY_HELP)
    {
      if (pressed)
        mouseHID.buttons |= 2;
      else
        mouseHID.buttons &=~ 2;
    }
    if (code==HIDKEY_UP)
    {
      mouseHID.y = pressed ? -settings.mouse_speed : 0;
    }
    if (code==HIDKEY_DOWN)
    {
      mouseHID.y = pressed ? +settings.mouse_speed : 0;
    }
    if (code==HIDKEY_LEFT)
    {
      mouseHID.x = pressed ? -settings.mouse_speed : 0;
    }
    if (code==HIDKEY_RIGHT)
    {
      mouseHID.x = pressed ? +settings.mouse_speed : 0;
    }
    
    if (memcmp(&lastMouseHID,&mouseHID,sizeof(mouseHID)))
    {
      lastMouseHID = mouseHID;
      HID_Send(&mouseHID,sizeof(mouseHID));
      return 0;
    }
  }
  else if (extended_mode==2)
  {
    if (raw==AMIGA_KEY_KP_MULTIPLY)
    {
      touched=1;
      SetExtendedMode(0);
      gamepadHID.buttons = 0;
      gamepadHID.x = 0;
      gamepadHID.y = 0;
    }
    for (int i=0; i<16; ++i)
    {
      if (gamepad_button_table[i] == raw)
      {
        touched = 1;
        if (pressed)
          gamepadHID.buttons |= (1 << i);
        else
          gamepadHID.buttons &=~ (1 << i);
      }
    }
    if (raw==AMIGA_KEY_UP)
    {
      touched=1;
      thrust_y = pressed ? -1 : 0;
    }
    if (raw==AMIGA_KEY_DOWN)
    {
      touched=1;
      thrust_y = pressed ? +1 : 0;
    }
    if (raw==AMIGA_KEY_LEFT)
    {
      touched=1;
      thrust_x = pressed ? -1 : 0;
    }
    if (raw==AMIGA_KEY_RIGHT)
    {
      touched=1;
      thrust_x = pressed ? +1 : 0;
    }
    if (touched)
    {
      ApplyThrust();
      if (memcmp(&lastMouseHID,&mouseHID,sizeof(mouseHID)))
      {
        lastGamepadHID = gamepadHID;
        HID_Send(&gamepadHID,sizeof(gamepadHID));
      }
      touched = 0;

      return 0;
    }
  }
  else
  {
    if (raw == AMIGA_KEY_HELP)
    {
      help_mode = pressed ? 1 : 0;
    }
  }
  
  if (help_mode)
  {
    switch (code)
    {
    case HIDKEY_M:
      SetExtendedMode(1);
      help_mode = 0;
      elapsed_ms_counter = HAL_GetTick();
      return 0;

    case HIDKEY_G:
      SetExtendedMode(2);
      help_mode = 0;
      elapsed_ms_counter = HAL_GetTick();
      return 0;
    
    // help-escape = pause 
    case HIDKEY_ESCAPE:
      code = HIDKEY_PAUSE;
      break;
      
    case HIDKEY_DELETE:
      if (pressed)
      {
        settings.media_keys ^= 1;
        SetMediaKeysMode();
      }
      return 0;

    case HIDKEY_F1:
    case HIDKEY_F2:
    case HIDKEY_F3:
    case HIDKEY_F4:
    case HIDKEY_F5:
    case HIDKEY_F6:
    case HIDKEY_F7:
    case HIDKEY_F8:
    case HIDKEY_F9:
    case HIDKEY_F10:
      {
        int n = code - HIDKEY_F1;
        if (settings.media_keys)
        {
          if (pressed)
          {
            mediaHID.keys |= media_table[n];
          }
          else
          {
            mediaHID.keys &=~ media_table[n];
          }
          HID_Send(&mediaHID,sizeof(mediaHID));
          return 0;

        }
        else
        {
          code = fn_table[n];
        }
      }
      break;
      
    default:
      return 0;
    }
    
  }
  
  if (code==0) return 0;

  // is modifier?
  if (raw>=0x60 && raw<0x68)
  {
    if (settings.swap_ctrl_and_alt)
    {
      switch(code)
      {
      case HIDKEY_MODIFIER_LEFT_CTRL:
        code = HIDKEY_MODIFIER_LEFT_ALT;
        break;
      case HIDKEY_MODIFIER_LEFT_ALT:
        code = HIDKEY_MODIFIER_LEFT_CTRL;
        break;
      case HIDKEY_MODIFIER_RIGHT_ALT:
        code = HIDKEY_MODIFIER_RIGHT_CTRL;
        break;
      case HIDKEY_MODIFIER_RIGHT_UI:
        code = HIDKEY_MODIFIER_RIGHT_ALT;
        break;
      default:
        break;
      }
    }
        
    if (pressed)
    {
      keyboardHID.modifiers |= code;
    }
    else
    {
      keyboardHID.modifiers &=~ code;
    }
  }
  else
  {
    if (pressed)
    {
      int found=0;
      for (int i=0; i<n_pressed_keys; ++i)
      {
        if (keyboardHID.key[i] == code)
        {
          found=1;
          break;
        }
      }
      if (!found)
      {
        if (n_pressed_keys<6)
        {
          keyboardHID.key[n_pressed_keys]=code;
          n_pressed_keys++;
        }
      }
    }
    else
    {
      for (int i=0; i<n_pressed_keys; ++i)
      {
        if (keyboardHID.key[i] != code) continue;
        n_pressed_keys--;
        if (n_pressed_keys>0 && i!=n_pressed_keys)
        {
          keyboardHID.key[i] = keyboardHID.key[n_pressed_keys];
        }
        keyboardHID.key[n_pressed_keys]=0;
        break;
      }
    }
  }
  return 1;
}

// called by EXTI0_IRQHandler
//
// see Appendix G, Keyboard Interface in Amiga Hardware Reference Manual
//
void clock_irq_handler()
{
  static uint8_t val=0;
  static uint8_t clocks=0;
  
  // (1) collect bits, convert to logical LOW and HIGH
  val <<= 1;
  val |= (HAL_GPIO_ReadPin(GPIOA,DATA_Pin)^1);
  ++clocks;
  if (clocks==8)
  {
      // last bit was KEY PRESSED bit, reorder
      uint8_t key=(val>>1) | (val<<7);
      val = 0;
      clocks=0;
      
      // I'm collecting up to 8 keypresses in case mainloop is blocked/busy in a simple array
      if (buffer_data[7]<7)
      {
        buffer_data[buffer_data[7]]=key;
        buffer_data[7]++;
      }
      
      // finally, handshake back to the keyboard as described
      GPIO_InitTypeDef GPIO_InitStruct;
      GPIO_InitStruct.Pin = DATA_Pin;
      GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
      GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
      HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
      
      HAL_GPIO_WritePin(GPIOA,DATA_Pin,GPIO_PIN_RESET);
      HAL_Delay_us(85);
      GPIO_InitStruct.Pin = DATA_Pin;
      GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  }
}

